In [35]:
import pandas as pd

# Create DataFrame

In [36]:
empty_df= pd.DataFrame()
print(empty_df)

Empty DataFrame
Columns: []
Index: []

# Create DataFrame With List

In [37]:
lst= ["Harsh", "Krunal", "Karan", "Himanshu", "Hashmukh"]
lst

['Harsh', 'Krunal', 'Karan', 'Himanshu', 'Hashmukh']

In [38]:
df1= pd.DataFrame(lst)
df1

          0
0     Harsh
1    Krunal
2     Karan
3  Himanshu
4  Hashmukh

In [39]:
lst_of_lst=[[1, 2, 3], [4, 5, 6], [7, 8, 9]]
lst_of_lst

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [40]:
df2= pd.DataFrame(lst_of_lst)
df2

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

# Create DataFrame With Dictionary

In [41]:
df3= pd.DataFrame({
    "Name": lst,
    "Age": [21, 21, 22, 23, 23]
})
df3

       Name  Age
0     Harsh   21
1    Krunal   21
2     Karan   22
3  Himanshu   23
4  Hashmukh   23

# Create DataFrame With Use Of Dictionary of Seriea

In [43]:
df5= pd.DataFrame({"Name": pd.Series(["Harsh" ,"Karan", "Krunal"]), "Age": pd.Series([21, 22, 20])})
df5

     Name  Age
0   Harsh   21
1   Karan   22
2  Krunal   20